In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

obj = Series(range(4),index=['d','a','b','c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [4]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [5]:
frame = DataFrame(np.arange(8).reshape(2,4),index=['three','one'],columns=['d','a','b','c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [6]:
frame.sort_index() # 행 기준

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [7]:
frame.sort_index(1) #열 기준

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [8]:
frame.sort_index(1,ascending=False) # 열 기준 내림차순

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [9]:
frame = DataFrame({'b':[4,7,3,2],'a':[4,9,2,5],'c':[5,3,7,9]})
frame

   b  a  c
0  4  4  5
1  7  9  3
2  3  2  7
3  2  5  9

In [10]:
frame.sort_values(by='b')

   b  a  c
3  2  5  9
2  3  2  7
0  4  4  5
1  7  9  3

In [12]:
frame.sort_values(by='a')

   b  a  c
2  3  2  7
0  4  4  5
3  2  5  9
1  7  9  3

In [13]:
obj = Series([100,23,55,44,22,99,33])
obj.rank()

0    7.0
1    2.0
2    5.0
3    4.0
4    1.0
5    6.0
6    3.0
dtype: float64

In [15]:
obj.rank(ascending=False) #내림차순으로 순위를 매김

0    1.0
1    6.0
2    3.0
3    4.0
4    7.0
5    2.0
6    5.0
dtype: float64

In [16]:
obj = Series([100,23,100,44,22,99,33])
obj.rank()

0    6.5
1    2.0
2    6.5
3    4.0
4    1.0
5    5.0
6    3.0
dtype: float64

In [17]:
obj.rank(method='first')

0    6.0
1    2.0
2    7.0
3    4.0
4    1.0
5    5.0
6    3.0
dtype: float64

In [18]:
frame = DataFrame({'b':[4,7,3,2],'a':[4,9,2,5],'c':[5,3,7,9]})
frame.rank(1)

     b    a    c
0  1.5  1.5  3.0
1  2.0  3.0  1.0
2  2.0  1.0  3.0
3  1.0  2.0  3.0

In [19]:
frame = DataFrame({'b':[4,7,3,2],'a':[4,9,2,5],'c':[5,3,7,np.nan]})
frame

   b  a    c
0  4  4  5.0
1  7  9  3.0
2  3  2  7.0
3  2  5  NaN

In [21]:
#합이나 평균을 구하면 기본적으로 열을 기준으로 구한다.
frame.sum()

b    16.0
a    20.0
c    15.0
dtype: float64

In [22]:
frame.mean()

b    4.0
a    5.0
c    5.0
dtype: float64

In [23]:
frame.sum(skipna=False) # Nan 반영하도록

b    16.0
a    20.0
c     NaN
dtype: float64

In [24]:
frame.idxmax() # 최대치가 있는 위치

b    1
a    1
c    2
dtype: int64

In [25]:
frame.idxmin() #최소치가 있는 위치

b    3
a    2
c    1
dtype: int64

In [26]:
obj = Series(['c','a','d','a','a','b','b','c','c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [29]:
unique = obj.unique()
unique

array(['c', 'a', 'd', 'b'], dtype=object)

In [30]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [31]:
obj.value_counts(sort=False)

c    3
b    2
d    1
a    3
dtype: int64

In [32]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [33]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [34]:
obj[obj.isin(['b','c'])]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [36]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [37]:
frame = DataFrame ({'X': ['c','a','d','a','a','b','b','c','c'],
                    'Y' : ['f','g','d','g','h','e','d','h','f'],
                    'Z' : ['a','e','d','g','d','e','q','b','c']})
frame

   X  Y  Z
0  c  f  a
1  a  g  e
2  d  d  d
3  a  g  g
4  a  h  d
5  b  e  e
6  b  d  q
7  c  h  b
8  c  f  c

In [38]:
result = frame.apply(pd.value_counts)
result

     X    Y    Z
a  3.0  NaN  1.0
b  2.0  NaN  1.0
c  3.0  NaN  1.0
d  1.0  2.0  2.0
e  NaN  1.0  2.0
f  NaN  2.0  NaN
g  NaN  2.0  1.0
h  NaN  2.0  NaN
q  NaN  NaN  1.0

In [39]:
result = frame.apply(pd.value_counts).fillna(0)
result

     X    Y    Z
a  3.0  0.0  1.0
b  2.0  0.0  1.0
c  3.0  0.0  1.0
d  1.0  2.0  2.0
e  0.0  1.0  2.0
f  0.0  2.0  0.0
g  0.0  2.0  1.0
h  0.0  2.0  0.0
q  0.0  0.0  1.0

In [46]:
data = DataFrame([[np.nan,6.5,3.],[np.nan,np.nan,np.nan],[np.nan,np.nan,np.nan],[np.nan,6.5,3.]])
data

    0    1    2
0 NaN  6.5  3.0
1 NaN  NaN  NaN
2 NaN  NaN  NaN
3 NaN  6.5  3.0

In [47]:
cleaned = data.dropna()
cleaned

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [48]:
data.dropna(how='all')

    0    1    2
0 NaN  6.5  3.0
3 NaN  6.5  3.0

In [49]:
data

    0    1    2
0 NaN  6.5  3.0
1 NaN  NaN  NaN
2 NaN  NaN  NaN
3 NaN  6.5  3.0

In [50]:
clean2 = data.dropna(1)
clean2

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [51]:
clean2 = data.dropna(1,how='all')
clean2

     1    2
0  6.5  3.0
1  NaN  NaN
2  NaN  NaN
3  6.5  3.0

In [54]:
df = DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = np.nan
df.iloc[:2,2] = np.nan
df.iloc[0,0] = np.nan
df

          0         1         2
0       NaN       NaN       NaN
1  0.575770       NaN       NaN
2 -0.377739       NaN -0.727538
3  0.238601       NaN  0.054334
4  0.426394  0.526539  1.330539
5 -2.521751 -1.289023 -0.143926
6  0.885084 -0.887124 -0.648553

In [55]:
df.dropna(thresh=2)

          0         1         2
2 -0.377739       NaN -0.727538
3  0.238601       NaN  0.054334
4  0.426394  0.526539  1.330539
5 -2.521751 -1.289023 -0.143926
6  0.885084 -0.887124 -0.648553

In [56]:
df.fillna({1: 0.5, 2: -1})

          0         1         2
0       NaN  0.500000 -1.000000
1  0.575770  0.500000 -1.000000
2 -0.377739  0.500000 -0.727538
3  0.238601  0.500000  0.054334
4  0.426394  0.526539  1.330539
5 -2.521751 -1.289023 -0.143926
6  0.885084 -0.887124 -0.648553

In [57]:
df2 = df.fillna({1: 0.5, 3: -1})
df2

          0         1         2
0       NaN  0.500000       NaN
1  0.575770  0.500000       NaN
2 -0.377739  0.500000 -0.727538
3  0.238601  0.500000  0.054334
4  0.426394  0.526539  1.330539
5 -2.521751 -1.289023 -0.143926
6  0.885084 -0.887124 -0.648553